redisTestResult/redisMutiThreadsTestResult/redis_test_result_by_memtier_benchmark_F_OFF_3nd/redis_result_Gauss82_F_OFF_P7_3nd20230717222327.log
20        Threads
5         Connections per thread
50        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         7236.10          ---          ---         2.77632         2.68700         5.37500         6.36700      7815.55 
Gets        28935.99     24497.98      4438.01         2.75786         2.68700         5.37500         6.36700     26656.50 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      36172.09     24497.98      4438.01         2.76155         2.68700         5.37500         6.36700     34472.05 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.223        0.000
SET       2.415        5.000
SET       2.479       10.000
SET       2.527       15.000
SET       2.575       20.000
SET       2.607       25.000
SET       2.639       30.000
SET       2.655       35.000
SET       2.671       40.000
SET       2.687       45.000
SET       2.687       50.000
SET       2.703       52.500
SET       2.703       55.000
SET       2.719       57.500
SET       2.719       60.000
SET       2.735       62.500
SET       2.735       65.000
SET       2.751       67.500
SET       2.751       70.000
SET       2.767       72.500
SET       2.783       75.000
SET       2.799       76.250
SET       2.815       77.500
SET       2.831       78.750
SET       2.863       80.000
SET       2.927       81.250
SET       2.991       82.500
SET       3.023       83.750
SET       3.055       85.000
SET       3.087       86.250
SET       3.103       87.500
SET       3.119       88.125
SET       3.135       88.750
SET       3.135       89.375
SET       3.151       90.000
SET       3.151       90.625
SET       3.167       91.250
SET       3.167       91.875
SET       3.183       92.500
SET       3.199       93.125
SET       3.199       93.750
SET       3.215       94.062
SET       3.215       94.375
SET       3.215       94.688
SET       3.231       95.000
SET       3.231       95.312
SET       3.247       95.625
SET       3.247       95.938
SET       3.263       96.250
SET       3.279       96.562
SET       3.295       96.875
SET       3.311       97.031
SET       3.327       97.188
SET       3.359       97.344
SET       3.423       97.500
SET       3.711       97.656
SET       4.447       97.812
SET       4.799       97.969
SET       4.991       98.125
SET       5.119       98.281
SET       5.215       98.438
SET       5.247       98.516
SET       5.279       98.594
SET       5.311       98.672
SET       5.343       98.750
SET       5.343       98.828
SET       5.375       98.906
SET       5.375       98.984
SET       5.407       99.062
SET       5.407       99.141
SET       5.439       99.219
SET       5.439       99.258
SET       5.439       99.297
SET       5.471       99.336
SET       5.471       99.375
SET       5.471       99.414
SET       5.503       99.453
SET       5.503       99.492
SET       5.535       99.531
SET       5.567       99.570
SET       5.599       99.609
SET       5.599       99.629
SET       5.663       99.648
SET       5.791       99.668
SET       5.951       99.688
SET       6.015       99.707
SET       6.079       99.727
SET       6.111       99.746
SET       6.175       99.766
SET       6.207       99.785
SET       6.239       99.805
SET       6.239       99.814
SET       6.239       99.824
SET       6.271       99.834
SET       6.271       99.844
SET       6.303       99.854
SET       6.303       99.863
SET       6.303       99.873
SET       6.335       99.883
SET       6.335       99.893
SET       6.367       99.902
SET       6.367       99.907
SET       6.367       99.912
SET       6.367       99.917
SET       6.399       99.922
SET       6.399       99.927
SET       6.399       99.932
SET       6.399       99.937
SET       6.431       99.941
SET       6.431       99.946
SET       6.431       99.951
SET       6.463       99.954
SET       6.463       99.956
SET       6.463       99.958
SET       6.463       99.961
SET       6.495       99.963
SET       6.495       99.966
SET       6.495       99.968
SET       6.495       99.971
SET       6.527       99.973
SET       6.527       99.976
SET       6.527       99.977
SET       6.559       99.978
SET       6.559       99.979
SET       6.559       99.980
SET       6.591       99.982
SET       6.591       99.983
SET       6.591       99.984
SET       6.623       99.985
SET       6.655       99.987
SET       6.719       99.988
SET       6.751       99.988
SET       6.847       99.989
SET       7.007       99.990
SET       7.135       99.990
SET       7.231       99.991
SET       7.295       99.991
SET       7.327       99.992
SET       7.359       99.993
SET       7.519       99.993
SET       7.775       99.994
SET       7.903       99.994
SET       8.255       99.995
SET       8.447       99.995
SET       8.575       99.995
SET       8.575       99.995
SET       9.279       99.996
SET       9.343       99.996
SET       9.599       99.996
SET       9.663       99.997
SET       9.727       99.997
SET       9.983       99.997
SET       9.983       99.997
SET       9.983       99.997
SET      11.071       99.998
SET      11.071       99.998
SET      11.199       99.998
SET      11.199       99.998
SET      11.775       99.998
SET      11.775       99.998
SET      12.031       99.998
SET      12.031       99.999
SET      12.031       99.999
SET      12.031       99.999
[...]
SET      12.095       99.999
SET      12.095       99.999
SET      12.095       99.999
[...]
SET      12.159       99.999
SET      12.159       99.999
SET      12.159       99.999
[...]
SET      12.543       99.999
SET      12.543      100.000
SET      12.543      100.000
SET      12.543      100.000
[...]
SET     327.679      100.000
SET     327.679      100.000
---
GET       0.679        0.000
GET       2.271        5.000
GET       2.399       10.000
GET       2.479       15.000
GET       2.527       20.000
GET       2.575       25.000
GET       2.607       30.000
GET       2.623       35.000
GET       2.655       40.000
GET       2.671       45.000
GET       2.687       50.000
GET       2.687       52.500
GET       2.687       55.000
GET       2.703       57.500
GET       2.703       60.000
GET       2.719       62.500
GET       2.719       65.000
GET       2.735       67.500
GET       2.735       70.000
GET       2.751       72.500
GET       2.767       75.000
GET       2.767       76.250
GET       2.783       77.500
GET       2.783       78.750
GET       2.799       80.000
GET       2.815       81.250
GET       2.863       82.500
GET       2.959       83.750
GET       3.023       85.000
GET       3.055       86.250
GET       3.087       87.500
GET       3.103       88.125
GET       3.103       88.750
GET       3.119       89.375
GET       3.135       90.000
GET       3.135       90.625
GET       3.151       91.250
GET       3.151       91.875
GET       3.167       92.500
GET       3.183       93.125
GET       3.183       93.750
GET       3.199       94.062
GET       3.199       94.375
GET       3.215       94.688
GET       3.215       95.000
GET       3.215       95.312
GET       3.231       95.625
GET       3.231       95.938
GET       3.247       96.250
GET       3.263       96.562
GET       3.279       96.875
GET       3.279       97.031
GET       3.295       97.188
GET       3.311       97.344
GET       3.327       97.500
GET       3.375       97.656
GET       4.047       97.812
GET       4.607       97.969
GET       4.895       98.125
GET       5.055       98.281
GET       5.183       98.438
GET       5.215       98.516
GET       5.247       98.594
GET       5.279       98.672
GET       5.311       98.750
GET       5.343       98.828
GET       5.343       98.906
GET       5.375       98.984
GET       5.375       99.062
GET       5.407       99.141
GET       5.407       99.219
GET       5.439       99.258
GET       5.439       99.297
GET       5.439       99.336
GET       5.471       99.375
GET       5.471       99.414
GET       5.471       99.453
GET       5.503       99.492
GET       5.503       99.531
GET       5.535       99.570
GET       5.567       99.609
GET       5.567       99.629
GET       5.599       99.648
GET       5.663       99.668
GET       5.823       99.688
GET       5.983       99.707
GET       6.047       99.727
GET       6.079       99.746
GET       6.143       99.766
GET       6.175       99.785
GET       6.239       99.805
GET       6.239       99.814
GET       6.271       99.824
GET       6.271       99.834
GET       6.271       99.844
GET       6.303       99.854
GET       6.303       99.863
GET       6.303       99.873
GET       6.335       99.883
GET       6.335       99.893
GET       6.367       99.902
GET       6.367       99.907
GET       6.367       99.912
GET       6.367       99.917
GET       6.399       99.922
GET       6.399       99.927
GET       6.399       99.932
GET       6.399       99.937
GET       6.431       99.941
GET       6.431       99.946
GET       6.463       99.951
GET       6.463       99.954
GET       6.463       99.956
GET       6.463       99.958
GET       6.495       99.961
GET       6.495       99.963
GET       6.495       99.966
GET       6.527       99.968
GET       6.527       99.971
GET       6.527       99.973
GET       6.559       99.976
GET       6.559       99.977
GET       6.591       99.978
GET       6.591       99.979
GET       6.623       99.980
GET       6.687       99.982
GET       6.815       99.983
GET       7.007       99.984
GET       7.295       99.985
GET       7.903       99.987
GET       8.255       99.988
GET       8.447       99.988
GET       8.575       99.989
GET       9.343       99.990
GET       9.727       99.990
GET      10.175       99.991
GET      11.519       99.991
GET      12.095       99.992
GET      12.607       99.993
GET     323.583       99.993
GET     323.583       99.994
GET     323.583       99.994
GET     323.583       99.995
GET     323.583       99.995
GET     323.583       99.995
[...]
GET     323.583       99.996
GET     323.583       99.996
GET     323.583       99.996
GET     325.631       99.997
GET     325.631       99.997
GET     325.631       99.997
[...]
GET     325.631       99.998
GET     325.631       99.998
GET     325.631       99.998
[...]
GET     325.631       99.999
GET     325.631       99.999
GET     325.631       99.999
[...]
GET     325.631      100.000
GET     325.631      100.000
GET     325.631      100.000
[...]
GET     327.679      100.000
GET     327.679      100.000
---
WAIT      0.000      100.000